---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationPartSizeMap Constructor
FabricationPartSizeMap Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | FabricationPartSizeMap(String, Double, Double, Boolean) | Creates a new instance of the FabricationPartSizeMap class. |
|  | FabricationPartSizeMap(String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32) | Creates a new instance of the FabricationPartSizeMap class. |

# See Also

FabricationPartSizeMap Class

FabricationPartSizeMap Members

Autodesk.Revit.DB.Fabrication Namespace